<h1>🧙‍♂️ Подготовка хоббитов к путешествию</h1>

<?php
$allhobbits = ["Бильбо", "Самуил", "Дори", "Нори", "Оливер", "Тоби", "Лили", "Гари"];

$partysize = rand(2,5);
shuffle($allhobbits);
$party = array_slice($allhobbits,0,$partysize);

$countparty = count($party);
$names = implode(", ", $party);

#-------------------------------------------------------------------------------------------------------

$transports = ["Карета", "Единорог", "Машина", "Нет транспорта"];
$transport = $transports[rand(0,3)];

#-------------------------------------------------------------------------------------------------------

$allsupplies = ["лембас", "яблоки", "грибы", "мед", "сыр", "сало", "копченная рыба"];
$suppliessize = rand(2,6);
$supplies = array_slice($allsupplies,0,$suppliessize);

#-------------------------------------------------------------------------------------------------------
$partyEvents = [
    $party[array_rand($party)] . " решил испечь пирог перед выходом. ",
    $party[array_rand($party)] . " не смог найти свой плащ пришлось искать всем вместе. ",
    $party[array_rand($party)] . " потерял карту и пришлось искать ее по всему дому. ",
    $party[array_rand($party)] . " помог собрать лишний мешок орехов, и это задержало выход. ",
    $party[array_rand($party)] . " наоборот всех поторопил и сборы пошли быстрее! ",
]
;

#--------------------------------------------------------------------------------------------------------

$eventssize = rand(1,3);
$events = array_slice($partyEvents,0,$eventssize);

#---------------------------------------------------------------------------------------------------------

$delayDays = count($supplies);
$delayDays = $delayDays + count($events);

#---------------------------------------------------------------------------------------------------------

$nazgulDays = 5



?>

<div  class= 'block'>
    в поход отправятся <?= $countparty?> хоббитов: <?= $names?><br>
</div>

<div  class= 'block'>
    <?if ($transport === 'Нет транспорта') {?>
    к сожалению, транспорта нет. Хоббитам придется идти пешком!
    <?} else {?>
        Хоббиты нашли транспорт: <?=$transport?>
    <?}?>
</div>

<div  class= 'block'>
    Собрали припасы:<br>
    <?foreach ($supplies as $supply) {
        echo("- $supply <br>" );
    }?>
</div>

<div  class= 'block'>
    Случившиеся событие:<br>
    <?foreach ($events as $event) {
        echo("- $event <br>" );
    }?>
</div>

<div  class= 'block'>
    Столько дней собирались Хоббиты: <?= $delayDays?><br>
</div>

<div  class= 'block'>
    <? if ($delayDays < $nazgulDays)
        {echo("✨ Хоббиты успели выйти в путь раньше назгулов!");};
       if ($delayDays == $nazgulDays)
        {echo("✨ Хоббиты успели от назгулов в самый последний момент");};
       if ($delayDays > $nazgulDays)
        {echo sprintf("Назгулы настигли хоббитов! Хоббиты слишком долго собирались и опаздали на опоздали на столько дней: $delayDays");};
        
?><br>
</div>