<h1>🧙‍♂️ Подготовка хоббитов к путешествию</h1>

<?php
$allhobbits = ["Бильбо", "Самуил", "Дори", "Нори", "Оливер", "Тоби", "Лили", "Гари"];

$partysize = rand(2,5);
shuffle($allhobbits);
$party = array_slice($allhobbits,0,$partysize);

$countparty = count($party);
$names = implode(", ", $party);

#-------------------------------------------------------------------------------------------------------

$transports = ["Карета", "Единорог", "Машина", "Нет транспорта"];
$transport = $transports[rand(0,3)];

#-------------------------------------------------------------------------------------------------------

$allsupplies = ["лембас", "яблоки", "грибы", "мед", "сыр", "сало", "копченная рыба"];
$suppliessize = rand(2,6);
$supplies = array_slice($allsupplies,0,$suppliessize);

#-------------------------------------------------------------------------------------------------------

$partyEvents = [
    "{hobbit} решил испечь пирог перед выходом. ",
    "{hobbit} не смог найти свой плащ пришлось искать всем вместе. ",
    "{hobbit} потерял карту и пришлось искать ее по всему дому. ",
    "{hobbit} помог собрать лишний мешок орехов, и это задержало выход. ",
    "{hobbit} наоборот всех поторопил и сборы пошли быстрее! ",
]



?>

<div  class= 'block'>
    в поход отправятся <?= $countparty?> хоббитов: <?= $names?><br>
<div>

<div  class= 'block'>
    <?if ($transport === 'Нет транспорта') {?>
    к сожалению, транспорта нет. Хоббитам придется идти пешком!
    <?} else {?>
        Хоббиты нашли транспорт: <?=$transport?>
    <?}?>
</div>

<div  class= 'block'>
    Собрали припасы:<br>
    <?foreach ($supplies as $supply) {
        echo("- $supply <br>" );
    }?>
<div>